"""
Пусть в программе имеется следующий список ваших гостей (в общем случае состоит из n значений):

guests = ["Анна", "Маша", "Федор", "Сергей"]
Добавьте в конец этого списка еще одного гостя с именем "Владимир". 

Выведите на экран (в консоль) число операций с позиции Big O, необходимых для добавления этого нового значения.

P.S. Вывод нужно делать в формате: 1 - для O(1); n - для O(n); log n - для O(log n); n^2 - для O(n^2); n! - для O(n!).
"""


guests = ["Анна", "Маша", "Федор", "Сергей"]

# здесь продолжайте программу
guests.append("Владимир")

print(1)